[
  {
    "title": "Israeli Settler Attack During West Bank Olive Harvest Leads to Death of a Boy",
    "link": "https://www.nytimes.com/2025/11/14/world/middleeast/west-bank-settler-violence-olive-harvest.html",
    "pubDate": "Fri, 14 Nov 2025 20:10:04 +0000",
    "summary": "Palestinians see the violence, and its tolerance by right-wing Israeli officialdom, as part of a broader campaign to harass them and make life so unbearable that they will abandon their villages.",
    "source": "NYTimes"
  },
  {
    "title": "Russia Pummels Kyiv and Tries to Plunge Ukraine Into Darkness",
    "link": "https://www.nytimes.com/2025/11/14/world/europe/ukraine-kyiv-russia-strike.html",
    "pubDate": "Fri, 14 Nov 2025 18:15:54 +0000",
    "summary": "A strike that killed six was the latest in a series of aerial assaults, many of which have targeted the power grid in an effort to deprive Ukrainians of energy as winter looms.",
    "source": "NYTimes"
  },
  {
    "title": "Rapist Called One of UK’s Worst Sex Offenders Is Sentenced to Life",
    "link": "https://www.nytimes.com/2025/11/14/world/europe/uk-xu-chao-rape-sentence.html",
    "pubDate": "Fri, 14 Nov 2025 16:51:29 +0000",
    "summary": "Xu Chao admitted to multiple attacks against female Chinese students over a three-year period, confessing to drugging, assaulting and filming his victims.",
    "source": "NYTimes"
  },
  {
    "title": "Atrocities in Sudan Require World’s Attention, U.N. Says",
    "link": "https://www.nytimes.com/2025/11/14/world/africa/sudan-atrocities-civilians-un.html",
    "pubDate": "Fri, 14 Nov 2025 18:24:44 +0000",
    "summary": "The United Nations’ top human rights body ordered an inquiry into mass killings and sexual violence during the country’s worsening civil war.",
    "source": "NYTimes"
  },
  {
    "title": "Zelensky’s Image Is Stained as Corruption Inquiry Shakes His Inner Circle",
    "link": "https://www.nytimes.com/2025/11/14/world/europe/zelensky-corruption-investigation.html",
    "pubDate": "Fri, 14 Nov 2025 17:15:08 +0000",
    "summary": "The revelations are a remarkable reversal for the Ukrainian president, who once presented himself as a leader who would clean up the country’s politics.",
    "source": "NYTimes"
  },
  {
    "title": "Modi’s Coalition Sweeps Indian State Election Criticized for Voter Roll Purge",
    "link": "https://www.nytimes.com/2025/11/14/world/asia/india-bihar-election-modi.html",
    "pubDate": "Fri, 14 Nov 2025 16:41:06 +0000",
    "summary": "The coalition was on course to form a government in Bihar, a state of 130 million people where the opposition had claimed foul play over deletions from voter lists.",
    "source": "NYTimes"
  },
  {
    "title": "Mexico City Loves Street Food. Its Sewer System Does Not.",
    "link": "https://www.nytimes.com/2025/11/14/world/americas/mexico-flooding-sewers-food.html",
    "pubDate": "Fri, 14 Nov 2025 21:27:45 +0000",
    "summary": "The worst rainy season in decades caused flooding around much of the city. Fat from its many taco shops, restaurants and markets was a major reason for blocked drains, officials say.",
    "source": "NYTimes"
  },
  {
    "title": "At U.N. Security Council, Russia Counters Trump Gaza Plan With Its Own",
    "link": "https://www.nytimes.com/2025/11/14/world/middleeast/russia-us-gaza-un-security-council.html",
    "pubDate": "Fri, 14 Nov 2025 23:18:25 +0000",
    "summary": "The Trump administration wants the Security Council to adopt a resolution that has the 20-point U.S. plan annexed, effectively making it international law.",
    "source": "NYTimes"
  },
  {
    "title": "U.S. Envoy Said to Be Planning to Meet With Senior Hamas Official",
    "link": "https://www.nytimes.com/2025/11/14/world/middleeast/hamas-us-witkoff.html",
    "pubDate": "Fri, 14 Nov 2025 18:19:57 +0000",
    "summary": "An in-person encounter between Steve Witkoff and Khalil al-Hayya would signal the Trump administration’s interest in keeping a direct line of communication with the group.",
    "source": "NYTimes"
  },
  {
    "title": "A.I. Cheating Rattles Top Universities in South Korea",
    "link": "https://www.nytimes.com/2025/11/14/world/asia/south-korea-ai-cheating-college.html",
    "pubDate": "Fri, 14 Nov 2025 05:14:31 +0000",
    "summary": "As many elite colleges struggle to adapt to the technology, the nation’s most prestigious universities said dozens of students used artificial intelligence tools to cheat.",
    "source": "NYTimes"
  },
  {
    "title": "Kenya’s Key Export Used to Be Coffee. Now It’s Cheap Labor.",
    "link": "https://www.nytimes.com/2025/11/14/world/africa/kenya-exports-labor-saudi-arabia-economy.html",
    "pubDate": "Fri, 14 Nov 2025 10:02:18 +0000",
    "summary": "There’s big money in sending poor workers abroad. Here’s how the economics work.",
    "source": "NYTimes"
  },
  {
    "title": "Zelensky Ousted a Heavyweight Mayor. Was It a Power Grab?",
    "link": "https://www.nytimes.com/2025/11/14/world/europe/ukraine-zelensky-odesa-gennadiy-trukhanov.html",
    "pubDate": "Fri, 14 Nov 2025 19:11:57 +0000",
    "summary": "President Volodymyr Zelensky removed Odesa’s mayor, raising fears he might be using his wartime powers to tighten control over opposition-run cities.",
    "source": "NYTimes"
  },
  {
    "title": "Fears Fuel Tanker Was Seized by Iran in Strait of Hormuz",
    "link": "https://www.nytimes.com/2025/11/14/world/middleeast/iran-tanker-strait-of-hormuz.html",
    "pubDate": "Sat, 15 Nov 2025 00:14:59 +0000",
    "summary": "The ship, which was flying a Marshall Islands flag, was bound for Singapore when it lost contact with its managers and appeared headed toward Iran.",
    "source": "NYTimes"
  },
  {
    "title": "As Trump Targets Antifa in U.S., Rubio Labels European Groups as Terrorists",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/trump-rubio-antifa.html",
    "pubDate": "Sat, 15 Nov 2025 01:18:17 +0000",
    "summary": "The State Department’s search for leftist groups to designate as terrorist organizations appears rooted in President Trump’s executive order on domestic groups that he calls antifa.",
    "source": "NYTimes"
  },
  {
    "title": "Trump Plan Could Limit Green Cards for Immigrants From Travel Ban Countries",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/trump-travel-ban-visas-green-card.html",
    "pubDate": "Fri, 14 Nov 2025 19:50:19 +0000",
    "summary": "The policy change is a major expansion of the administration’s push to crack down on immigration from countries that it says lack sufficient screening and vetting abilities.",
    "source": "NYTimes"
  },
  {
    "title": "Napoleon’s Brooch, Lost as He Fled Waterloo, Sells for $4.4 Million",
    "link": "https://www.nytimes.com/2025/11/14/world/europe/napoleon-diamond-brooch-auction.html",
    "pubDate": "Fri, 14 Nov 2025 16:56:48 +0000",
    "summary": "The diamond-encrusted jewel, which the 19th-century French emperor wore on his hat, was lost along with other valuables as he retreated from his final battle.",
    "source": "NYTimes"
  },
  {
    "title": "Indigenous People Take the Stage at COP30 Climate Talks in Belém, Brazil",
    "link": "https://www.nytimes.com/2025/11/14/climate/cop30-belem-indigenous-people.html",
    "pubDate": "Fri, 14 Nov 2025 21:41:34 +0000",
    "summary": "This summit is unlike any of its predecessors in at least one significant way: The Indigenous presence is palpable and strong.",
    "source": "NYTimes"
  },
  {
    "title": "While Asian Immigrants Work, Burglars Target Their Homes",
    "link": "https://www.nytimes.com/2025/11/14/world/asia/asian-immigrants-burglaries.html",
    "pubDate": "Sat, 15 Nov 2025 02:00:08 +0000",
    "summary": "Some law enforcement officials say they think organized crime rings from South America, in particular from Colombia, are responsible for the crime sprees.",
    "source": "NYTimes"
  },
  {
    "title": "Trump Administration Revokes Biden Ban on Drilling and Mining in Alaska Wilderness",
    "link": "https://www.nytimes.com/2025/11/13/climate/trump-revokes-biden-ban-on-drilling-mining-in-alaska-wilderness.html",
    "pubDate": "Fri, 14 Nov 2025 01:34:28 +0000",
    "summary": "The decision to allow oil and gas drilling in Alaska’s ecologically sensitive North Slope has the support of the state’s governor and senators.",
    "source": "NYTimes"
  },
  {
    "title": "Justice Dept. Memo Blessing Boat Strikes Is Said to Rely on Trump’s Claims About Cartels",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/boat-strikes-doj-memo-trump.html",
    "pubDate": "Fri, 14 Nov 2025 21:38:30 +0000",
    "summary": "Accounts of a secret Justice Department memo offer a window into how administration lawyers approved the president’s desired course of action.",
    "source": "NYTimes"
  },
  {
    "title": "What the U.S. Absence at COP30 Tells Us",
    "link": "https://www.nytimes.com/video/world/100000010519999/what-the-us-absence-at-cop30-tells-us.html",
    "pubDate": "Thu, 13 Nov 2025 23:42:53 +0000",
    "summary": "World leaders are meeting at the COP30 this week to discuss climate. The U.S. was not part of this meeting. Somini Sengupta, our international climate reporter, discusses what this absence means.",
    "source": "NYTimes"
  },
  {
    "title": "Carney Accelerates Economic Plan for Canada to Rely Less on U.S. Amid Trade War",
    "link": "https://www.nytimes.com/2025/11/13/world/canada/carney-economy-trade-trump-tariffs.html",
    "pubDate": "Thu, 13 Nov 2025 23:42:04 +0000",
    "summary": "Prime Minister Mark Carney fast-tracked mines and other natural resource projects to the dismay of some Indigenous groups and many environmentalists.",
    "source": "NYTimes"
  },
  {
    "title": "BBC Apologizes to Trump Over Film Edit but Declines to Pay Compensation",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/bbc-apology-trump.html",
    "pubDate": "Thu, 13 Nov 2025 22:24:50 +0000",
    "summary": "The BBC said it would not rebroadcast a misleadingly edited documentary but added, “We strongly disagree there is a basis for a defamation claim.”",
    "source": "NYTimes"
  },
  {
    "title": "Of Books and Men",
    "link": "https://www.nytimes.com/2025/11/14/world/booker-prize-flesh-david-szalay-pakistan-trump.html",
    "pubDate": "Fri, 14 Nov 2025 05:35:02 +0000",
    "summary": "My colleague, the book critic Dwight Garner, tells us about “Flesh” by David Szalay, this year’s Booker Prize winner.",
    "source": "NYTimes"
  },
  {
    "title": "U.S. Officials Raise Concerns About Saudi Arabia’s Bid for F-35 Jets",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/trump-saudi-fighter-jets.html",
    "pubDate": "Thu, 13 Nov 2025 21:48:33 +0000",
    "summary": "A Pentagon intelligence report says China could try to acquire advanced F-35 technology in Saudi Arabia if the Trump administration sells jets to the kingdom.",
    "source": "NYTimes"
  },
  {
    "title": "Former Prince Andrew and Another Prominent Briton Come Up in the Epstein Emails",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/epstein-files-mountbatten-windsor-mandelson.html",
    "pubDate": "Thu, 13 Nov 2025 20:52:21 +0000",
    "summary": "Newly released files from Jeffrey Epstein include correspondence with Andrew Mountbatten-Windsor and Peter Mandelson, the former British ambassador to Washington.",
    "source": "NYTimes"
  },
  {
    "title": "Family of Fisherman Killed in U.S. Military Strike Says It Wants Justice",
    "link": "https://www.nytimes.com/2025/11/13/world/americas/trump-drug-boat-strikes-colombian-fisherman.html",
    "pubDate": "Fri, 14 Nov 2025 01:39:25 +0000",
    "summary": "Colombia was a top U.S. ally in Latin America until the Trump administration began deadly strikes in international waters. Now, one family wants justice.",
    "source": "NYTimes"
  },
  {
    "title": "The Global Climate Leadership Vacuum",
    "link": "https://www.nytimes.com/2025/11/13/climate/cop30-un-climate-talks.html",
    "pubDate": "Thu, 13 Nov 2025 18:43:33 +0000",
    "summary": "The United States is largely absent from the United Nations climate negations in Brazil. So who is stepping up?",
    "source": "NYTimes"
  },
  {
    "title": "Israeli Settlers Burn West Bank Mosque Amid Rise in Violent Attacks",
    "link": "https://www.nytimes.com/2025/11/13/world/middleeast/israel-settlers-west-bank-mosque.html",
    "pubDate": "Thu, 13 Nov 2025 17:22:19 +0000",
    "summary": "Since the 2023 attack on Israel by Hamas, growing settler violence and Israeli attacks on Palestinian militants have thrown the West Bank into turmoil and displaced tens of thousands.",
    "source": "NYTimes"
  },
  {
    "title": "An Ontario Man Took a Bus for a Joyride. Turns Out, He’s Not a Bad Driver.",
    "link": "https://www.nytimes.com/2025/11/13/world/canada/hamilton-bus-stolen-canada.html",
    "pubDate": "Thu, 13 Nov 2025 16:02:37 +0000",
    "summary": "The incident in Hamilton, Ontario, ended safely with an arrest and no injuries (and all fares paid).",
    "source": "NYTimes"
  },
  {
    "title": "Bird Flu Ravaged the World’s Largest Elephant Seal Population, Study Finds",
    "link": "https://www.nytimes.com/2025/11/13/science/bird-flu-h5n1-elephant-seals.html",
    "pubDate": "Thu, 13 Nov 2025 16:00:09 +0000",
    "summary": "After the H5N1 virus hit the remote island of South Georgia in 2023, more than 50,000 breeding females may have disappeared.",
    "source": "NYTimes"
  },
  {
    "title": "Ukraine’s Dilemma as Pokrovsk Teeters: Save Lives or Keep Holding On",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/ukraine-pokrovsk-russia-battle.html",
    "pubDate": "Thu, 13 Nov 2025 17:27:16 +0000",
    "summary": "Military analysts and some Ukrainian commanders worry that Kyiv may be repeating the mistake of staying in an embattled city longer than it should, aiming to inflict far more casualties than it suffers.",
    "source": "NYTimes"
  },
  {
    "title": "In the Faroe Islands’ Soccer Team, the Players Also Have Day Jobs",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/this-scrappy-soccer-team-has-a-cinderella-chance-at-making-the-world-cup.html",
    "pubDate": "Thu, 13 Nov 2025 17:23:07 +0000",
    "summary": "The Faroe Islands, rugged green specks in the North Atlantic, are an underdog. Most of the guys on the team have day jobs.",
    "source": "NYTimes"
  },
  {
    "title": "What Our Photographer Saw as a Safe City Became a Blood Bath",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/ukraine-russia-pokrovsk.html",
    "pubDate": "Thu, 13 Nov 2025 16:27:59 +0000",
    "summary": "The Ukrainian city of Pokrovsk is on the verge of becoming another shattered trophy for the Russian Army.",
    "source": "NYTimes"
  },
  {
    "title": "Juan Ponce Enrile, a Political Power in the Philippines, Dies at 101",
    "link": "https://www.nytimes.com/2025/11/13/world/asia/juan-ponce-enrile-dead.html",
    "pubDate": "Thu, 13 Nov 2025 15:54:55 +0000",
    "summary": "A protégé of Ferdinand Marcos, he helped administer martial law for eight years before turning on his patron in the “People Power” uprising of 1986.",
    "source": "NYTimes"
  },
  {
    "title": "How Pakistan’s Spending Blitz Helped Win Over Trump and Flip U.S. Policy",
    "link": "https://www.nytimes.com/2025/11/13/world/asia/pakistan-trump-lobbying.html",
    "pubDate": "Thu, 13 Nov 2025 10:00:21 +0000",
    "summary": "As Pakistan has hired lobbyists with close ties to President Trump, it has also received favorable tariff treatment and unique access in Washington.",
    "source": "NYTimes"
  },
  {
    "title": "Fake Bomb Threats Baffle the Police Across Asia",
    "link": "https://www.nytimes.com/2025/11/13/world/asia/bomb-threats-fake-south-korea-japan.html",
    "pubDate": "Thu, 13 Nov 2025 10:00:12 +0000",
    "summary": "The threatening emails and faxes bear the signature of a man who says he is being impersonated. The police in five nations have failed to stem them.",
    "source": "NYTimes"
  },
  {
    "title": "He Helped Cities Anticipate Damage From Storms",
    "link": "https://www.nytimes.com/2025/11/13/climate/austin-becker-coastal-flood-warning.html",
    "pubDate": "Thu, 13 Nov 2025 10:00:05 +0000",
    "summary": "Austin Becker developed an early warning system to protect critical infrastructure from storms. His project’s funding was eliminated in April.",
    "source": "NYTimes"
  },
  {
    "title": "Man Accused of Running Southeast Asia Scam Compound Is Extradited to China",
    "link": "https://www.nytimes.com/2025/11/13/world/asia/scam-center-she-zhijiang-extradited-china.html",
    "pubDate": "Thu, 13 Nov 2025 15:17:34 +0000",
    "summary": "China and the United States say She Zhijiang, a Chinese-born businessman, ran a major scam compound in Myanmar. He was arrested in Bangkok in 2022.",
    "source": "NYTimes"
  },
  {
    "title": "China’s ‘Wolf Warrior’ Diplomacy Returns With Threat Against Japan’s Leader",
    "link": "https://www.nytimes.com/2025/11/13/world/asia/china-japan-takaichi-taiwan.html",
    "pubDate": "Thu, 13 Nov 2025 10:56:27 +0000",
    "summary": "A Chinese diplomat’s call to cut off the prime minister’s “filthy head” signaled a revival of a combative style Beijing had tried to dial back.",
    "source": "NYTimes"
  },
  {
    "title": "How France Remembers the November 2015 Terrorist Attacks in Paris",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/france-paris-terrorist-attacks-anniversary.html",
    "pubDate": "Thu, 13 Nov 2025 21:59:28 +0000",
    "summary": "A decade ago, Islamic State militants killed 130 people in an assault that shocked France. Some survivors are still struggling, but for many of their compatriots, memories of the attacks are growing more distant.",
    "source": "NYTimes"
  },
  {
    "title": "Rubio Shrugs Off Allies’ Concerns Over U.S. Drug Strikes",
    "link": "https://www.nytimes.com/2025/11/12/world/americas/rubio-g7-caribbean-drug-boat-strikes.html",
    "pubDate": "Thu, 13 Nov 2025 02:12:02 +0000",
    "summary": "Secretary of State Marco Rubio said no one raised the Caribbean military operation in closed-door meetings at a G7 summit. But ministers from France and the European Union publicly called them unlawful.",
    "source": "NYTimes"
  },
  {
    "title": "Greenhouse Gas Emissions Head for a Record in 2025, Global Carbon Project Reports",
    "link": "https://www.nytimes.com/2025/11/12/climate/greenhouse-gas-emissions-china.html",
    "pubDate": "Thu, 13 Nov 2025 00:00:07 +0000",
    "summary": "But there are signs that greenhouse gas pollution in China might be slowing, according to a new analysis.",
    "source": "NYTimes"
  },
  {
    "title": "Former Syrian Security Official Indicted in Austria",
    "link": "https://www.nytimes.com/2025/11/12/world/europe/syria-security-official-indicted-war-crimes.html",
    "pubDate": "Fri, 14 Nov 2025 09:51:55 +0000",
    "summary": "Prosecutors say a Syrian security official accused of torture hid in plain sight in Europe for years, protected by Israeli and Austrian intelligence agents.",
    "source": "NYTimes"
  },
  {
    "title": "Iraq’s Prime Minister Leads in Elections but May Struggle to Form a Government",
    "link": "https://www.nytimes.com/2025/11/12/world/middleeast/iraq-elections.html",
    "pubDate": "Wed, 12 Nov 2025 23:23:41 +0000",
    "summary": "Mohammed al-Sudani pitches himself as someone who can keep Iranian influence in check, but his vote share may not be big enough to ensure a clear political victory.",
    "source": "NYTimes"
  },
  {
    "title": "South Asia on Edge",
    "link": "https://www.nytimes.com/2025/11/12/world/india-pakistan-epstein-trump.html",
    "pubDate": "Thu, 13 Nov 2025 05:09:11 +0000",
    "summary": "There are no known links between two bomb attacks in India and Pakistan, but they come as tensions between the countries are already high.",
    "source": "NYTimes"
  },
  {
    "title": "Gustavo Petro, the Rebel Turned President Willing to Take on Trump",
    "link": "https://www.nytimes.com/2025/11/12/world/americas/gustavo-petro-colombia-trump.html",
    "pubDate": "Wed, 12 Nov 2025 20:26:22 +0000",
    "summary": "From his guerrilla roots, Colombia’s president, Gustavo Petro, has long embraced a confrontational style. Now, he has incurred President Trump’s wrath and is facing political fallout at home.",
    "source": "NYTimes"
  },
  {
    "title": "As Belgium Races to Save U.S.A.I.D. Contraception, Some Supplies Are Reported Ruined",
    "link": "https://www.nytimes.com/2025/11/12/world/europe/belgium-usaid-contraception.html",
    "pubDate": "Wed, 12 Nov 2025 19:56:30 +0000",
    "summary": "The Belgian government is in talks with the Trump administration to save birth control stranded in a warehouse, but another shipment has been incorrectly stored.",
    "source": "NYTimes"
  },
  {
    "title": "Algeria Pardons Writer Boualem Sansal at Germany’s Request",
    "link": "https://www.nytimes.com/2025/11/12/world/africa/algeria-boualem-sansal-pardon.html",
    "pubDate": "Wed, 12 Nov 2025 21:00:56 +0000",
    "summary": "Boualem Sansal, an Algerian-French writer, was arrested on accusations of undermining national security during a visit to his homeland a year ago and sentenced to five years in prison.",
    "source": "NYTimes"
  },
  {
    "title": "Labour Party’s Internal Fight Goes Public, as Starmer’s Trouble Grows",
    "link": "https://www.nytimes.com/2025/11/12/world/europe/labour-party-starmer-challenge.html",
    "pubDate": "Wed, 12 Nov 2025 22:13:04 +0000",
    "summary": "An attempt by Keir Starmer’s allies to undercut a rival has forced into the open a party debate over whether to replace the prime minister.",
    "source": "NYTimes"
  },
  {
    "title": "Many Displaced Sudanese Feared Dead After Shipwreck Near Libya",
    "link": "https://www.nytimes.com/2025/11/12/world/africa/sudan-migrants-shipwreck-libya.html",
    "pubDate": "Wed, 12 Nov 2025 16:03:25 +0000",
    "summary": "Forty-two migrants were presumed dead after a rubber boat capsized off the Libyan coast this month. Many of the presumed victims were fleeing a raging conflict in Sudan.",
    "source": "NYTimes"
  },
  {
    "title": "How to Capture the Northern Lights With Just Your Smartphone",
    "link": "https://www.nytimes.com/2025/11/12/us/how-to-photograph-northern-lights-iphone.html",
    "pubDate": "Wed, 12 Nov 2025 21:54:22 +0000",
    "summary": "Modern cellphone cameras make it easy to capture the famously fickle Aurora Borealis.",
    "source": "NYTimes"
  },
  {
    "title": "Israel Reopens Gaza Aid Route It Had Closed for Months",
    "link": "https://www.nytimes.com/2025/11/12/world/middleeast/israel-gaza-zikim-crossing-aid.html",
    "pubDate": "Wed, 12 Nov 2025 21:09:43 +0000",
    "summary": "The cease-fire with Hamas has blunted the hunger faced by Gazans during the war. But aid agencies say Israeli restrictions are still hobbling their work.",
    "source": "NYTimes"
  },
  {
    "title": "Pakistan’s Army Chief Is Granted Sweeping Authority Over All Military Branches",
    "link": "https://www.nytimes.com/2025/11/12/world/asia/pakistan-army-chief-power.html",
    "pubDate": "Wed, 12 Nov 2025 19:43:30 +0000",
    "summary": "A constitutional amendment in the nuclear-armed country extends the chief’s power over all the military and brings Pakistan’s highest court under tighter political control.",
    "source": "NYTimes"
  },
  {
    "title": "Deadly Blasts in India and Pakistan Set Region on Edge",
    "link": "https://www.nytimes.com/2025/11/12/world/asia/india-pakistan-explosions.html",
    "pubDate": "Wed, 12 Nov 2025 20:57:56 +0000",
    "summary": "The rare explosions in the country’s capitals have not been directly linked, but there are fears the governments will blame each other after their previous military conflict alarmed the world.",
    "source": "NYTimes"
  },
  {
    "title": "Trump says he will take legal action against BBC over Panorama edit",
    "link": "https://www.bbc.com/news/articles/c891jp9j79do?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 15 Nov 2025 03:09:48 GMT",
    "summary": "The US president confirmed he intends to sue the broadcaster for at least $1bn over the Panorama edit of a 2021 speech.",
    "source": "BBC World"
  },
  {
    "title": "Trump rolls back tariffs on dozens of food products",
    "link": "https://www.bbc.com/news/articles/cdjr4xw83eko?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 15 Nov 2025 02:11:46 GMT",
    "summary": "The executive order allowing products like coffee and bananas to escape tariffs comes as the Trump administration faces mounting pressure over rising prices.",
    "source": "BBC World"
  },
  {
    "title": "US justice department investigates Epstein's alleged ties to Clinton and banks after Trump request",
    "link": "https://www.bbc.com/news/articles/cj97x2lere0o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 15 Nov 2025 02:31:40 GMT",
    "summary": "Democrats are accusing Trump of using the justice department to deflect from his previous relationship with Epstein.",
    "source": "BBC World"
  },
  {
    "title": "Emails highlight Jeffrey Epstein and Steve Bannon relationship",
    "link": "https://www.bbc.com/news/articles/ckgy81jlxqgo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 22:39:09 GMT",
    "summary": "New documents show the pair discussing travel arrangements and UK politics in messages from 2018.",
    "source": "BBC World"
  },
  {
    "title": "China urges citizens not to visit Japan over Taiwan row",
    "link": "https://www.bbc.com/news/articles/crklvx2n7rzo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 15 Nov 2025 03:31:11 GMT",
    "summary": "Japanese PM Sanae Takaichi had suggested Tokyo could take military action if Beijing attacked Taiwan.",
    "source": "BBC World"
  },
  {
    "title": "Russian drone slams into block of flats in deadly wave of strikes across Kyiv",
    "link": "https://www.bbc.com/news/articles/cn4jn94gyllo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 19:16:08 GMT",
    "summary": "Six people are killed in Kyiv, and Ukraine targets one of Russia's biggest oil ports on the Black Sea coast.",
    "source": "BBC World"
  },
  {
    "title": "South Africa to investigate 'mystery' of planeload of Palestinians",
    "link": "https://www.bbc.com/news/articles/c3dn3g4jdxjo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 17:26:19 GMT",
    "summary": "It is not clear who chartered the plane carrying the Palestinians from Kenya to South Africa.",
    "source": "BBC World"
  },
  {
    "title": "Trump targets longtime MAGA ally Marjorie Taylor Greene",
    "link": "https://www.bbc.com/news/articles/c9wv4dx05q5o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 15 Nov 2025 03:50:59 GMT",
    "summary": "The Georgia congresswoman has criticised Trump's focus on foreign policy and handling of Jeffrey Epstein files.",
    "source": "BBC World"
  },
  {
    "title": "Three killed after bus crashes into Stockholm bus stop",
    "link": "https://www.bbc.com/news/articles/c629m7jm777o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 21:51:44 GMT",
    "summary": "The bus driver has been arrested but police say \"there is currently no indication that the incident was intentional\".",
    "source": "BBC World"
  },
  {
    "title": "UK court finds mining firm liable for Brazil's worst environmental disaster",
    "link": "https://www.bbc.com/news/articles/c8034v2e3l3o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 17:39:50 GMT",
    "summary": "The 2015 dam collapse killed 19 people, polluted a river and destroyed hundreds of homes.",
    "source": "BBC World"
  },
  {
    "title": "Tanzania president promises probe into election protest deaths",
    "link": "https://www.bbc.com/news/articles/c4gpdxp5vl2o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 17:32:00 GMT",
    "summary": "The opposition says that hundreds of people were killed during the unrest but there is no official death toll.",
    "source": "BBC World"
  },
  {
    "title": "Mass killings probe in Sudan will hold culprits to account, vows UN",
    "link": "https://www.bbc.com/news/articles/c70jd4elgwzo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 17:24:51 GMT",
    "summary": "\"There has been too much pretence and performance, and too little action,\" says UN human rights chief Volker Türk.",
    "source": "BBC World"
  },
  {
    "title": "Man who grabbed Ariana Grande in Singapore charged in court",
    "link": "https://www.bbc.com/news/articles/c051q4pnz39o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 07:14:06 GMT",
    "summary": "Johnson Wen rushed at the actress in Singapore, during the Asia-Pacific premiere of Wicked: For Good.",
    "source": "BBC World"
  },
  {
    "title": "Second brother of French anti-drugs campaigner shot dead in Marseille",
    "link": "https://www.bbc.com/news/articles/c7v846p9nd1o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 12:45:52 GMT",
    "summary": "Investigators fear the murder of a second brother of Amine Kessaci is meant as a warning to him.",
    "source": "BBC World"
  },
  {
    "title": "Canadian boycott of US travel shows no sign of slowing",
    "link": "https://www.bbc.com/news/articles/ce9d7pj543eo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 03:16:48 GMT",
    "summary": "October marked the 10th month of decreased Canadian travel to the US, with many staying away over political and trade tensions.",
    "source": "BBC World"
  },
  {
    "title": "The Aussie giving War & Peace a 'bogan' remake",
    "link": "https://www.bbc.com/news/articles/cx2lkjd2kmdo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 22:00:42 GMT",
    "summary": "Ander Louis has written a new version of Leo Tolstoy's classic Russian novel in Australian slang.",
    "source": "BBC World"
  },
  {
    "title": "Pakistan's army has always been influential - now its chief has new powers",
    "link": "https://www.bbc.com/news/articles/c9d6w1glz3qo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 23:49:17 GMT",
    "summary": "Critics say the move, which entrenches the military's hold on power, paves the way toward autocracy.",
    "source": "BBC World"
  },
  {
    "title": "At 16, I was experimented on by the CIA and now I'm suing",
    "link": "https://www.bbc.com/news/articles/cvgdngkxedzo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 15 Nov 2025 00:14:49 GMT",
    "summary": "Lana Ponting is part of a class-action lawsuit against the Canadian government for its alleged role in the MK-Ultra experiments.",
    "source": "BBC World"
  },
  {
    "title": "Prashant Kishor: Why India's political start-ups rarely succeed",
    "link": "https://www.bbc.com/news/articles/cz7p5xn8qjpo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 15 Nov 2025 02:55:39 GMT",
    "summary": "Prashant Kishor’s new party, Jan Suraaj, created a media splash but flopped, winning no seats in Bihar.",
    "source": "BBC World"
  },
  {
    "title": "Record settler attacks in West Bank opening up rifts within Israel",
    "link": "https://www.bbc.com/news/articles/cwykze63r2xo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 22:01:26 GMT",
    "summary": "More than 260 settler attacks in October resulted in Palestinians being injured or having property damaged, according to the UN.",
    "source": "BBC World"
  },
  {
    "title": "'Astonishingly lethal': BBC reports from site of Russian strike in Kyiv",
    "link": "https://www.bbc.com/news/videos/c3w9je1d3jno?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 14:04:30 GMT",
    "summary": "The BBC's James Landale reports from the east of the capital where a drone struck a multi-storey residential building.",
    "source": "BBC World"
  },
  {
    "title": "Watch: Mud volcano erupts in southern Taiwan",
    "link": "https://www.bbc.com/news/videos/ced6jd1zdnjo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 07:36:04 GMT",
    "summary": "The Wandan mud volcano is a particularly unusual example of the geological phenomenon, an expert told the BBC.",
    "source": "BBC World"
  },
  {
    "title": "Watch: Bear runs onto airport tarmac, halting flights",
    "link": "https://www.bbc.com/news/videos/cx20zn57v3po?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 08:23:56 GMT",
    "summary": "An airport in Japan temporarily suspended flights on Wednesday after a bear wandered onto its grounds.",
    "source": "BBC World"
  },
  {
    "title": "Watch: Blue Origin rocket successfully lands booster for first time",
    "link": "https://www.bbc.com/news/videos/c5yd0zd6eddo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Fri, 14 Nov 2025 04:32:06 GMT",
    "summary": "Jeff Bezos' space company saw its first successful return landing of a reusable booster - a feat that SpaceX pioneered.",
    "source": "BBC World"
  },
  {
    "title": "Russia's AI robot falls seconds after being unveiled",
    "link": "https://www.bbc.com/news/videos/crre8g5e45jo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Wed, 12 Nov 2025 11:33:59 GMT",
    "summary": "Footage shows the moment Russia's first anthropomorphic robot fell just seconds after its debut",
    "source": "BBC World"
  },
  {
    "title": "Kenyan Workers Get Abused Abroad. The President’s Family and Allies Profit.",
    "link": "https://www.nytimes.com/2025/11/14/world/europe/kenya-president-saudi-arabia-maids.html",
    "pubDate": "Fri, 14 Nov 2025 10:00:22 +0000",
    "summary": "President William Ruto’s government acts as an arm of an industry whose leaders compare women to dogs and blame them for their own abuse, a Times investigation found.",
    "source": "NYTimes"
  },
  {
    "title": "Hurricane Melissa Leaves Behind a Staggering Homelessness Toll in Jamaica",
    "link": "https://www.nytimes.com/2025/11/14/world/americas/hurricane-melissa-homeless-jamaica.html",
    "pubDate": "Fri, 14 Nov 2025 13:35:11 +0000",
    "summary": "Two weeks after Hurricane Melissa wrecked western Jamaica, officials are beginning to grapple with the challenge of trying to find housing for thousands of families.",
    "source": "NYTimes"
  }
]