[
  {
    "title": "United States Extradites Three Alleged Members of Tren de Aragua to Chile to Face Prosecution for Murder, Kidnapping, and other Violent Offenses",
    "link": "https://www.justice.gov/opa/pr/united-states-extradites-three-alleged-members-tren-de-aragua-chile-face-prosecution-murder",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "",
    "source": "DOJ"
  },
  {
    "title": "Mexican National Extradited Back to Florida to Face Forced Labor Charges",
    "link": "https://www.justice.gov/opa/pr/mexican-national-extradited-back-florida-face-forced-labor-charges",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "Alexander Villatoro Moreno, also known as “Quichi,” 53, made his first appearance in federal court today after the Mexican government recently apprehended and extradited him to the United States. Villatoro Moreno faces four charges, including conspiracy to violate the Racketeer Influenced and Corrupt Organizations (RICO) Act, conspiracy to commit forced labor, conspiracy to obstruct proceedings before agencies, and one count of forced labor for conduct alleged to have occurred between September 2015 and December 2017. &nbsp;&nbsp;",
    "source": "DOJ"
  },
  {
    "title": "New Jersey Man Charged with Cyberstalking in Connection with Violent Network ‘764’",
    "link": "https://www.justice.gov/opa/pr/new-jersey-man-charged-cyberstalking-connection-violent-network-764",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "Marek Cherkaoui, 21, of Egg Harbor Township, New Jersey, was arrested today on cyberstalking offenses in connection with a Nihilistic Violent Extremist (NVE) network known as 764.",
    "source": "DOJ"
  },
  {
    "title": "Announcing Upcoming FY25 FOIA Reporting Deadlines (Updated)",
    "link": "https://www.justice.gov/oip/blog/announcing-upcoming-fy25-foia-reporting-deadlines-updated",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "The Office of Information Policy announces updated Annual FOIA Report, Chief FOIA Officer Report, and Quarterly Report submission&nbsp;deadlines&nbsp;and resources.",
    "source": "DOJ"
  },
  {
    "title": "West Virginia Woman Pleads Guilty to Lying to Obtain U.S. Citizenship After Committing War Crimes in Bosnia",
    "link": "https://www.justice.gov/opa/pr/west-virginia-woman-pleads-guilty-lying-obtain-us-citizenship-after-committing-war-crimes",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "A naturalized U.S. citizen from Bosnia and Herzegovina pleaded guilty on Nov. 10 to criminal charges related to her lying about her prior criminal conduct to obtain U.S. citizenship.",
    "source": "DOJ"
  },
  {
    "title": "Hawaii Man Sentenced to Life in Prison and to Pay Over $1M in Restitution for Sex Trafficking Three Adult Women and One Minor",
    "link": "https://www.justice.gov/opa/pr/hawaii-man-sentenced-life-prison-and-pay-over-1m-restitution-sex-trafficking-three-adult",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "Isaiah McCoy, 37, of Honolulu, Hawaii, was sentenced yesterday to life in prison after a jury found McCoy guilty in April of four counts of sex trafficking three adults and one minor, two counts of obstructing a sex trafficking investigation, seven counts of interstate and foreign travel or transportation in aid of racketeering enterprises, and one count of interstate travel for prostitution purposes. Additionally, the court ordered McCoy to pay the victims $1,017,241.00 in restitution.",
    "source": "DOJ"
  },
  {
    "title": "Department of Homeland Security Contractor Agrees to Pay $3.9M to Resolve Alleged Violations of the False Claims Act",
    "link": "https://www.justice.gov/opa/pr/department-homeland-security-contractor-agrees-pay-39m-resolve-alleged-violations-false",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "Zephyr Aviation LLC, located in Mineral, Virginia, and its owners Frederick Credno Jr. and Frederick W. Credno III have agreed to pay $3,901,000 to resolve allegations that they violated the False Claims Act by submitting inflated invoices for aviation contracts to the Department of Homeland Security (DHS).",
    "source": "DOJ"
  },
  {
    "title": "Virginia Man Sentenced to Life in Prison for Federal Hate Crime and Firearms Violation",
    "link": "https://www.justice.gov/opa/pr/virginia-man-sentenced-life-prison-federal-hate-crime-and-firearms-violation",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "Douglas Wayne Cornett of Spotsylvania County, Virginia, was sentenced to life in prison in federal court yesterday after he pleaded guilty to two federal hate crime charges, each involving an attempt to kill, and to discharging a firearm during a federal crime of violence.",
    "source": "DOJ"
  },
  {
    "title": "Hong Kong Businessman Indicted for Role in Filing False SEC Investment Adviser Forms on behalf of Sham Entities Used in Ramp-and-Dump Scheme",
    "link": "https://www.justice.gov/opa/pr/hong-kong-businessman-indicted-role-filing-false-sec-investment-adviser-forms-behalf-sham",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "A federal grand jury in the District of Columbia returned an indictment yesterday charging a Hong Kong man for his role in a conspiracy to file false and deceptive investment adviser forms with the U.S. Securities and Exchange Commission (SEC) for at least 10 shell business entities that he and co-conspirators created.",
    "source": "DOJ"
  },
  {
    "title": "Justice Department Announces Nationwide Actions to Combat Illicit North Korean Government Revenue Generation",
    "link": "https://www.justice.gov/opa/pr/justice-department-announces-nationwide-actions-combat-illicit-north-korean-government",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "The Justice Department today announced five guilty pleas and more than $15 million in civil forfeiture actions against the Democratic People’s Republic of Korea (DPRK) remote information technology (IT) work and virtual currency heist schemes.&nbsp;",
    "source": "DOJ"
  },
  {
    "title": "Cryptocurrency Investment Firm Founder Sentenced to Five Years in Prison for Defrauding Investors in $9.4M Ponzi Scheme",
    "link": "https://www.justice.gov/opa/pr/cryptocurrency-investment-firm-founder-sentenced-five-years-prison-defrauding-investors-94m",
    "pubDate": "Fri, 14 Nov 2025 12:00:00 +0000",
    "summary": "An Oklahoma man was sentenced yesterday to 60 months in prison and ordered to pay over $1 million in forfeiture and over $170,000 in restitution for his leading role in a cryptocurrency investment fraud conspiracy.",
    "source": "DOJ"
  },
  {
    "title": "Tennessee Woman Pleads Guilty to Charges Related to Creation and Distribution of Videos Depicting Monkey Torture and Mutilation",
    "link": "https://www.justice.gov/opa/pr/tennessee-woman-pleads-guilty-charges-related-creation-and-distribution-videos-depicting",
    "pubDate": "Thu, 13 Nov 2025 12:00:00 +0000",
    "summary": "A Tennessee woman pleaded guilty to crimes based on her involvement with online groups dedicated to creating and distributing videos depicting acts of extreme violence and sexual abuse against monkeys.",
    "source": "DOJ"
  },
  {
    "title": "Telemarketing Company Operators Sentenced for Roles in Genetic Testing Fraud Scheme",
    "link": "https://www.justice.gov/opa/pr/telemarketing-company-operators-sentenced-roles-genetic-testing-fraud-scheme",
    "pubDate": "Thu, 13 Nov 2025 12:00:00 +0000",
    "summary": "Two men from Texas and Florida were sentenced today to four years and two years in prison, respectively, for their roles as leaders of a marketing company that solicited Medicare beneficiaries for medically unnecessary genetic testing.",
    "source": "DOJ"
  },
  {
    "title": "Former Virginia Business Owner Sentenced for Employment Tax Fraud",
    "link": "https://www.justice.gov/opa/pr/former-virginia-business-owner-sentenced-employment-tax-fraud",
    "pubDate": "Thu, 13 Nov 2025 12:00:00 +0000",
    "summary": "A Virginia man and former business owner was sentenced to 80 months in prison for not accounting for and paying employment taxes to the IRS.",
    "source": "DOJ"
  },
  {
    "title": "Justice Department Sues Governor Gavin Newsom for California’s Race-Based Redistricting Plan",
    "link": "https://www.justice.gov/opa/pr/justice-department-sues-governor-gavin-newsom-californias-race-based-redistricting-plan",
    "pubDate": "Thu, 13 Nov 2025 12:00:00 +0000",
    "summary": "WASHINGTON – The Justice Department announced today that it <a href=\"https://links-1.govdelivery.com/CL0/https:%2F%2Fwww.justice.gov%2Fopa%2Fmedia%2F1417291%2Fdl%3Finline=%26utm_medium=email%26utm_source=govdelivery/1/0100019a7ec24ef4-c5418cd9-d96d-4d60-93a1-87032f8d30bc-000000/YWzQ9m3uRvkEdpNqttXNea29tMQunw5PMBq12tFXFGI=431\" target=\"_blank\">filed legal action</a> against Governor Gavin Newsom and Secretary of State Shirley Weber for the State of California’s newly adopted redistricting plan enacted with the passage of Proposition 50. The suit alleges that the plan mandates racially gerrymandered congressional districts in violation of the Equal Protection Clause of the Fourteenth Amendment to the U.S. Constitution.",
    "source": "DOJ"
  },
  {
    "title": "Five MS-13 Members Found Guilty of Committing String of Six Grisly Murders to Advance Their Standing in the Criminal Street Gang",
    "link": "https://www.justice.gov/opa/pr/five-ms-13-members-found-guilty-committing-string-six-grisly-murders-advance-their-standing",
    "pubDate": "Mon, 10 Nov 2025 12:00:00 +0000",
    "summary": "Five members of the transnational criminal organization Mara Salvatrucha 13 (MS-13) were found guilty by a jury today of committing six murders to advance their standing in the gang – killings in which the victims",
    "source": "DOJ"
  },
  {
    "title": "Arizona Man Sentenced to Six Years in Prison for Plot Targeting Christian Churches",
    "link": "https://www.justice.gov/opa/pr/arizona-man-sentenced-six-years-prison-plot-targeting-christian-churches",
    "pubDate": "Fri, 07 Nov 2025 12:00:00 +0000",
    "summary": "Zimnako Salah, 46, of Phoenix, Arizona, was sentenced today in the Eastern District of California to six years in prison in connection with his plot targeting Christian churches.",
    "source": "DOJ"
  },
  {
    "title": "Mexican National Sentenced to 10 Years in Prison for Transporting Woman to Engage in Commercial Sex",
    "link": "https://www.justice.gov/opa/pr/mexican-national-sentenced-10-years-prison-transporting-woman-engage-commercial-sex",
    "pubDate": "Fri, 07 Nov 2025 12:00:00 +0000",
    "summary": "A 42-year-old citizen of Mexico has been ordered to prison after recruiting an 18-year-old victim from Mexico, abusing her and forcing her to engage in commercial sex acts in Houston, Texas.",
    "source": "DOJ"
  },
  {
    "title": "The United States Announces Agreement with Cornell University",
    "link": "https://www.justice.gov/opa/pr/united-states-announces-agreement-cornell-university",
    "pubDate": "Fri, 07 Nov 2025 12:00:00 +0000",
    "summary": "WASHINGTON – Today, the U.S. Department of Justice, U.S. Department of Education, and the U.S. Department of Health and Human Services announced an agreement with Cornell University (“Cornell”) that will protect Cornell’s students from violations of federal civil rights laws, including from discrimination based on race, sex, or national origin, and promote America’s hardworking farming and rural communities.",
    "source": "DOJ"
  },
  {
    "title": "U.S. Arrests Five Fugitives Wanted by Germany for Massive Fraud Scheme",
    "link": "https://www.justice.gov/opa/pr/us-arrests-five-fugitives-wanted-germany-massive-fraud-scheme",
    "pubDate": "Wed, 05 Nov 2025 12:00:00 +0000",
    "summary": "The United States arrested five international fugitives at the request of the Federal Republic of Germany, which has charged the individuals for their roles in a network involving German payment service processors that defrauded thousands of victims of more than €300 million and created a shadow financial system in Germany. Pursuant to its treaty obligations, the United States located and arrested the fugitives in the Central District of California for ultimate extradition to Germany.",
    "source": "DOJ"
  },
  {
    "title": "Three Chinese National Scholars from University of Michigan Laboratory Charged for Conspiring to Smuggle Biological Materials into the U.S.",
    "link": "https://www.justice.gov/opa/pr/three-chinese-national-scholars-university-michigan-laboratory-charged-conspiring-smuggle",
    "pubDate": "Wed, 05 Nov 2025 12:00:00 +0000",
    "summary": "Three research scholars from the People’s Republic of China (PRC) were charged today in a criminal complaint with conspiracy to smuggle biological materials into the United States and for making false statements to U.S. Customs and Border Protection Officers, announced United States Attorney Jerome F. Gorgon, Jr. These are the latest charges in a long string of cases stemming from University of Michigan (UM) international research activities.",
    "source": "DOJ"
  },
  {
    "title": "Fiber Laser Expert Convicted by Federal Jury of Economic Espionage and Theft of Trade Secrets",
    "link": "https://www.justice.gov/opa/pr/fiber-laser-expert-convicted-federal-jury-economic-espionage-and-theft-trade-secrets",
    "pubDate": "Wed, 05 Nov 2025 12:00:00 +0000",
    "summary": "A federal jury has convicted Ji Wang, 63, of Painted Post, NY, of two counts of economic espionage, one count of theft of trade secrets, one count of attempted economic espionage, and one count of attempted theft of trade secrets. &nbsp;",
    "source": "DOJ"
  },
  {
    "title": "Inmate Pleads Guilty to Assault on Corrections Officers",
    "link": "https://www.justice.gov/opa/pr/inmate-pleads-guilty-assault-corrections-officers",
    "pubDate": "Tue, 04 Nov 2025 12:00:00 +0000",
    "summary": "The U.S. Attorney’s Office for the Middle District of Pennsylvania and the National Security Division of the Department of Justice announced today that Abdulrahman El Bahnasawy, 27, of Ontario, Canada, pleaded guilty to offenses related to a 2020 attack on correctional officers at the United State Penitentiary Allenwood.",
    "source": "DOJ"
  },
  {
    "title": "Multiple Suspects Charged for Having Firearms in Conspiracy to Provide Material Support to ISIS",
    "link": "https://www.justice.gov/opa/pr/multiple-suspects-charged-having-firearms-conspiracy-provide-material-support-isis",
    "pubDate": "Mon, 03 Nov 2025 12:00:00 +0000",
    "summary": "Last Friday, the FBI arrested multiple suspects and took them into custody. They have now been charged for having firearms that would be used in a conspiracy to provide material support to ISIS—a vicious foreign terrorist organization hell-bent on murdering Americans. The complaint sets forth grievous allegations of a radical Islamic terror plot involving AR-style rifles, shotguns, handguns, and other tools for a tactical assault.",
    "source": "DOJ"
  },
  {
    "title": "Justice Department Announces Removal of Baltimore County from Sanctuary Jurisdiction List following Memorandum of Understanding with ICE to Collaborate on Immigration Enforcement",
    "link": "https://www.justice.gov/opa/pr/justice-department-announces-removal-baltimore-county-sanctuary-jurisdiction-list-following",
    "pubDate": "Fri, 31 Oct 2025 12:00:00 +0000",
    "summary": "WASHINGTON – Today, the Department of Justice announced the removal of Baltimore County, Maryland, as a designated sanctuary jurisdiction after the County recently signed a Memorandum of Understanding with ICE to collaborate on immigration enforcement. This follows the Department publishing a list of&nbsp;<a href=\"https://links-1.govdelivery.com/CL0/https:%2F%2Flinks-1.govdelivery.com%2FCL0%2Fhttps:%252F%252Fwww.justice.gov%252Fopa%252Fpr%252Fjustice-department-publishes-list-sanctuary-jurisdictions%253Futm_medium=email%2526utm_source=govdelivery%2F1%2F01000199874af8ec-7f8223d3-e252-46ed-a241-84e79557b9d3-000000%2FMaeEgbsdxBBGpqTLEIy18QaK5vVKVtZCiJABP5b-XLM=424/1/0100019a3ba62fd1-47892ddf-c9e7-4841-9592-a799182680c7-000000/jgwhcDGafo7GElJwBQvLlGSRnUe0HtrQf3z4_1OSbVA=429\" target=\"_blank\">sanctuary jurisdictions</a>&nbsp;on August 5th, 2025, in accordance with President Donald J. Trump’s&nbsp;<a href=\"https://links-1.govdelivery.com/CL0/https:%2F%2Flinks-1.govdelivery.com%2FCL0%2Fhttps:%252F%252Flinks-1.govdelivery.com%252FCL0%252Fhttps:%25252F%25252Fwww.federalregister.gov%25252Fdocuments%25252F2025%25252F05%25252F02%25252F2025-07789%25252Fprotecting-american-communities-from-criminal-aliens%25253Futm_medium=email%252526utm_source=govdelivery%252F1%252F010001987a7f581e-e7ba96f7-3157-46ed-b636-9a18a633f11b-000000%252FKqcWxCq5txkjLj4FN3wILy9JnLN0UPfYHgFEmGFB8jg=416%2F1%2F01000199874af8ec-7f8223d3-e252-46ed-a241-84e79557b9d3-000000%2FbCU4XJGGPpHqSexW3yJJv9lGqawde4ivZZ-zNO1YPcw=424/1/0100019a3ba62fd1-47892ddf-c9e7-4841-9592-a799182680c7-000000/KKPElYyjQuJCWTbMO4zBeYezvcDIMG17fsGxfbnq8iA=429\" target=\"_blank\">Executive Order 14287</a>.&nbsp;",
    "source": "DOJ"
  }
]